cmsis-svd/cmsis-svd/data/AmbiqMicro/apollo1.svd
          <fields>
            <field>
              <name>ADSEL6</name>
              <description>Select the number of measurements to average in the accumulate divide module for this slot.</description>
              <bitRange>[26:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AVG_1_MSRMT</name>
                  <description>Average in 1 measurement in the accumulate divide module for this slot. value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVG_2_MSRMTS</name>
                  <description>Average in 2 measurements in the accumulate divide module for this slot. value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVG_4_MSRMTS</name>
                  <description>Average in 4 measurements in the accumulate divide module for this slot. value.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVG_8_MSRMT</name>
                  <description>Average in 8 measurements in the accumulate divide module for this slot. value.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVG_16_MSRMTS</name>
                  <description>Average in 16 measurements in the accumulate divide module for this slot. value.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVG_32_MSRMTS</name>
                  <description>Average in 32 measurements in the accumulate divide module for this slot. value.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVG_64_MSRMTS</name>
                  <description>Average in 64 measurements in the accumulate divide module for this slot. value.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVG_128_MSRMTS</name>
                  <description>Average in 128 measurements in the accumulate divide module for this slot. value.</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>THSEL6</name>
              <description>Select track and hold delay for this slot.  NOTE: The track and hold delay must be less than 50us for correct operation.  When the ADC is configured to use the 1.5Mhz clock, the track and hold delay cannot exceed 64 clocks.</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1_ADC_CLK</name>
                  <description>1 ADC clock cycle. value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2_ADC_CLKS</name>
                  <description>2 ADC clock cycles. value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4_ADC_CLKS</name>
                  <description>4 ADC clock cycles. value.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8_ADC_CLKS</name>
                  <description>8 ADC clock cycles. value.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16_ADC_CLKS</name>
                  <description>16 ADC clock cycles. value.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32_ADC_CLKS</name>
                  <description>32 ADC clock cycles. value.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64_ADC_CLKS</name>
                  <description>64 ADC clock cycles. value.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>128_ADC_CLKS</name>
                  <description>128 ADC clock cycles. value.</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHSEL6</name>
              <description>Select one of the 13 channel inputs for this slot.</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EXT0</name>
                  <description>ADC_EXT0 external GPIO pin connection. value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXT1</name>
                  <description>ADC_EXT1 external GPIO pin connection. value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXT2</name>
                  <description>ADC_EXT2 external GPIO pin connection. value.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXT3</name>
                  <description>ADC_EXT3 external GPIO pin connection. value.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXT4</name>
                  <description>ADC_EXT4 external GPIO pin connection. value.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXT5</name>
                  <description>ADC_EXT5 external GPIO pin connection. value.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXT6</name>
                  <description>ADC_EXT6 external GPIO pin connection. value.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXT7</name>
                  <description>ADC_EXT7 external GPIO pin connection. value.</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEMP</name>
                  <description>ADC_TEMP internal temperature sensor. value.</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDD</name>
                  <description>ADC_VDD internal power rail connection. value.</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSS</name>
                  <description>ADC_VSS internal ground connection. value.</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VBATT</name>
                  <description>ADC_VBATT internal voltage divide-by-3 connection to input power rail. value.</description>
                  <value>12</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WCEN6</name>
              <description>This bit enables the window compare function for slot 6.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WCEN</name>
                  <description>Enable the window compare for slot 6. value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SLEN6</name>
              <description>This bit enables slot 6 for ADC conversions.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SLEN</name>
                  <description>Enable slot 6 for ADC conversions. value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SL7CFG</name>
          <description>Slot 7 Configuration Register</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x07070F03</resetMask>

          <fields>
            <field>
              <name>ADSEL7</name>
              <description>Select the number of measurements to average in the accumulate divide module for this slot.</description>
              <bitRange>[26:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AVG_1_MSRMT</name>
                  <description>Average in 1 measurement in the accumulate divide module for this slot. value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVG_2_MSRMTS</name>
                  <description>Average in 2 measurements in the accumulate divide module for this slot. value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVG_4_MSRMTS</name>
                  <description>Average in 4 measurements in the accumulate divide module for this slot. value.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVG_8_MSRMT</name>
                  <description>Average in 8 measurements in the accumulate divide module for this slot. value.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVG_16_MSRMTS</name>
                  <description>Average in 16 measurements in the accumulate divide module for this slot. value.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVG_32_MSRMTS</name>
                  <description>Average in 32 measurements in the accumulate divide module for this slot. value.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVG_64_MSRMTS</name>
                  <description>Average in 64 measurements in the accumulate divide module for this slot. value.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVG_128_MSRMTS</name>
                  <description>Average in 128 measurements in the accumulate divide module for this slot. value.</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>THSEL7</name>
              <description>Select track and hold delay for this slot.  NOTE: The track and hold delay must be less than 50us for correct operation.  When the ADC is configured to use the 1.5Mhz clock, the track and hold delay cannot exceed 64 clocks.</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1_ADC_CLK</name>
                  <description>1 ADC clock cycle. value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2_ADC_CLKS</name>
                  <description>2 ADC clock cycles. value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4_ADC_CLKS</name>
                  <description>4 ADC clock cycles. value.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8_ADC_CLKS</name>
                  <description>8 ADC clock cycles. value.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16_ADC_CLKS</name>
                  <description>16 ADC clock cycles. value.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32_ADC_CLKS</name>
                  <description>32 ADC clock cycles. value.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64_ADC_CLKS</name>
                  <description>64 ADC clock cycles. value.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>128_ADC_CLKS</name>
                  <description>128 ADC clock cycles. value.</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHSEL7</name>
              <description>Select one of the 13 channel inputs for this slot.</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EXT0</name>
                  <description>ADC_EXT0 external GPIO pin connection. value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXT1</name>
                  <description>ADC_EXT1 external GPIO pin connection. value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXT2</name>
                  <description>ADC_EXT2 external GPIO pin connection. value.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXT3</name>
                  <description>ADC_EXT3 external GPIO pin connection. value.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXT4</name>
                  <description>ADC_EXT4 external GPIO pin connection. value.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXT5</name>
                  <description>ADC_EXT5 external GPIO pin connection. value.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXT6</name>
                  <description>ADC_EXT6 external GPIO pin connection. value.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXT7</name>
                  <description>ADC_EXT7 external GPIO pin connection. value.</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEMP</name>
                  <description>ADC_TEMP internal temperature sensor. value.</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDD</name>
                  <description>ADC_VDD internal power rail connection. value.</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSS</name>
                  <description>ADC_VSS internal ground connection. value.</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VBATT</name>
                  <description>ADC_VBATT internal voltage divide-by-3 connection to input power rail. value.</description>
                  <value>12</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WCEN7</name>
              <description>This bit enables the window compare function for slot 7.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WCEN</name>
                  <description>Enable the window compare for slot 7. value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SLEN7</name>
              <description>This bit enables slot 7 for ADC conversions.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SLEN</name>
                  <description>Enable slot 7 for ADC conversions. value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WLIM</name>
          <description>Window Comparator Limits Register</description>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>ULIM</name>
              <description>Sets the upper limit for the wondow comparator.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>

