cmsis-svd/cmsis-svd/data/AmbiqMicro/apollo1.svd
      </registers>
    </peripheral>

    <peripheral>
      <name>CLKGEN</name>
      <version>1.0</version>
      <description>Clock Generator</description>
      <!-- <groupName>GROUP_CLKGEN</groupName> -->
      <baseAddress>0x40004000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x00000110</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>CLKGEN_RTC</name>
        <value>2</value>
      </interrupt>
      <registers>
        <register>
          <name>CALXT</name>
          <description>XT Oscillator Control</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000007FF</resetMask>

          <fields>
            <field>
              <name>CALXT</name>
              <description>XT Oscillator calibration value</description>
              <bitRange>[10:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CALRC</name>
          <description>RC Oscillator Control</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0003FFFF</resetMask>

          <fields>
            <field>
              <name>CALRC</name>
              <description>LFRC Oscillator calibration value</description>
              <bitRange>[17:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>ACALCTR</name>
          <description>Autocalibration Counter</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>

          <fields>
            <field>
              <name>ACALCTR</name>
              <description>Autocalibration Counter result.</description>
              <bitRange>[23:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>OCTRL</name>
          <description>Oscillator Control</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000007C3</resetMask>

          <fields>
            <field>
              <name>ACAL</name>
              <description>Autocalibration control</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable Autocalibration value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1024SEC</name>
                  <description>Autocalibrate every 1024 seconds value.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>512SEC</name>
                  <description>Autocalibrate every 512 seconds value.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTFREQ</name>
                  <description>Frequency measurement using XT value.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTFREQ</name>
                  <description>Frequency measurement using external clock value.</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OSEL</name>
              <description>Selects the RTC oscillator (1 => LFRC, 0 => XT)</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RTC_XT</name>
                  <description>RTC uses the XT value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_LFRC</name>
                  <description>RTC uses the LFRC value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FOS</name>
              <description>Oscillator switch on failure function</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable the oscillator switch on failure function value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable the oscillator switch on failure function value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOPRC</name>
              <description>Stop the LFRC Oscillator to the RTC</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable the LFRC Oscillator to drive the RTC value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP</name>
                  <description>Stop the LFRC Oscillator when driving the RTC value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOPXT</name>
              <description>Stop the XT Oscillator to the RTC</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable the XT Oscillator to drive the RTC value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP</name>
                  <description>Stop the XT Oscillator when driving the RTC value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CLKOUT</name>
          <description>CLKOUT Frequency Select</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000BF</resetMask>

          <fields>
            <field>
              <name>CKEN</name>
              <description>Enable the CLKOUT signal</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable CLKOUT value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable CLKOUT value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CKSEL</name>
              <description>CLKOUT signal select</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LFRC</name>
                  <description>LFRC value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT_DIV2</name>
                  <description>XT / 2 value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT_DIV4</name>
                  <description>XT / 4 value.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT_DIV8</name>
                  <description>XT / 8 value.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT_DIV16</name>
                  <description>XT / 16 value.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT_DIV32</name>
                  <description>XT / 32 value.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_1Hz</name>
                  <description>1 Hz as selected in RTC value.</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT_DIV2M</name>
                  <description>XT / 2^21 value.</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT</name>
                  <description>XT value.</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CG_100Hz</name>
                  <description>100 Hz as selected in CLKGEN value.</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC</name>
                  <description>HFRC value.</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_DIV2</name>
                  <description>HFRC / 2 value.</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_DIV4</name>
                  <description>HFRC / 4 value.</description>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_DIV8</name>
                  <description>HFRC / 8 value.</description>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_DIV32</name>
                  <description>HFRC / 32 value.</description>
                  <value>29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_DIV64</name>
                  <description>HFRC / 64 value.</description>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_DIV128</name>
                  <description>HFRC / 128 value.</description>
                  <value>31</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_DIV256</name>
                  <description>HFRC / 256 value.</description>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_CLK</name>
                  <description>Flash Clock value.</description>
                  <value>34</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFRC_DIV2</name>
                  <description>LFRC / 2 value.</description>
                  <value>35</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFRC_DIV32</name>
                  <description>LFRC / 32 value.</description>
                  <value>36</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFRC_DIV512</name>
                  <description>LFRC / 512 value.</description>
                  <value>37</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFRC_DIV32K</name>
                  <description>LFRC / 32768 value.</description>
                  <value>38</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT_DIV256</name>
                  <description>XT / 256 value.</description>
                  <value>39</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT_DIV8K</name>
                  <description>XT / 8192 value.</description>
                  <value>40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT_DIV64K</name>
                  <description>XT / 2^16 value.</description>
                  <value>41</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ULFRC_DIV16</name>
                  <description>Uncal LFRC / 16 value.</description>
                  <value>42</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ULFRC_DIV128</name>
                  <description>Uncal LFRC / 128 value.</description>
                  <value>43</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ULFRC_1Hz</name>
                  <description>Uncal LFRC / 1024 value.</description>
                  <value>44</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ULFRC_DIV4K</name>
                  <description>Uncal LFRC / 4096 value.</description>
                  <value>45</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ULFRC_DIV1M</name>
                  <description>Uncal LFRC / 2^20 value.</description>
                  <value>46</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_DIV64K</name>
                  <description>HFRC / 2^16 value.</description>
                  <value>47</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_DIV16M</name>
                  <description>HFRC / 2^24 value.</description>
                  <value>48</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFRC_DIV2M</name>
                  <description>LFRC / 2^20 value.</description>
                  <value>49</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRCNE</name>
                  <description>HFRC (not autoenabled) value.</description>
                  <value>50</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRCNE_DIV8</name>
                  <description>HFRC / 8 (not autoenabled) value.</description>
                  <value>51</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTNE</name>
                  <description>XT (not autoenabled) value.</description>
                  <value>53</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTNE_DIV16</name>
                  <description>XT / 16 (not autoenabled) value.</description>
                  <value>54</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFRCNE_DIV32</name>
                  <description>LFRC / 32 (not autoenabled) value.</description>
                  <value>55</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFRCNE</name>
                  <description>LFRC (not autoenabled) - Default for undefined values value.</description>
                  <value>57</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CLKKEY</name>
          <description>Key Register for Clock Control Register</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>CLKKEY</name>
              <description>Key register value.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Key</name>
                  <description>Key value.</description>
                  <value>71</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CCTRL</name>
          <description>HFRC Clock Control</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000007</resetValue>
          <resetMask>0x0000000F</resetMask>

          <fields>
            <field>
              <name>MEMSEL</name>
              <description>Flash Clock divisor</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HFRC_DIV25</name>
                  <description>Flash Clock is HFRC / 25 value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_DIV45</name>
                  <description>Flash Clock is HFRC / 45 value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CORESEL</name>
              <description>Core Clock divisor</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HFRC</name>
                  <description>Core Clock is HFRC value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_DIV2</name>
                  <description>Core Clock is HFRC / 2 value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_DIV3</name>
                  <description>Core Clock is HFRC / 3 value.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_DIV4</name>
                  <description>Core Clock is HFRC / 4 value.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_DIV5</name>
                  <description>Core Clock is HFRC / 5 value.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_DIV6</name>
                  <description>Core Clock is HFRC / 6 value.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_DIV7</name>
                  <description>Core Clock is HFRC / 7 value.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_DIV8</name>
                  <description>Core Clock is HFRC / 8 value.</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>Clock Generator Status</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>

          <fields>
            <field>
              <name>OSCF</name>
              <description>XT Oscillator is enabled but not oscillating</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

