cmsis-svd/cmsis-svd/data/AmbiqMicro/apollo1.svd
            </field>
            <field>
              <name>CTMRA3INT</name>
              <description>Counter/Timer A3 interrupt.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRB2INT</name>
              <description>Counter/Timer B2 interrupt.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRA2INT</name>
              <description>Counter/Timer A2 interrupt.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRB1INT</name>
              <description>Counter/Timer B1 interrupt.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRA1INT</name>
              <description>Counter/Timer A1 interrupt.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRB0INT</name>
              <description>Counter/Timer B0 interrupt.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRA0INT</name>
              <description>Counter/Timer A0 interrupt.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>INTSTAT</name>
          <description>Counter/Timer Interrupts: Status</description>
          <addressOffset>0x00000204</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>CTMRB3INT</name>
              <description>Counter/Timer B3 interrupt.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRA3INT</name>
              <description>Counter/Timer A3 interrupt.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRB2INT</name>
              <description>Counter/Timer B2 interrupt.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRA2INT</name>
              <description>Counter/Timer A2 interrupt.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRB1INT</name>
              <description>Counter/Timer B1 interrupt.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRA1INT</name>
              <description>Counter/Timer A1 interrupt.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRB0INT</name>
              <description>Counter/Timer B0 interrupt.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRA0INT</name>
              <description>Counter/Timer A0 interrupt.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>INTCLR</name>
          <description>Counter/Timer Interrupts: Clear</description>
          <addressOffset>0x00000208</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>CTMRB3INT</name>
              <description>Counter/Timer B3 interrupt.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRA3INT</name>
              <description>Counter/Timer A3 interrupt.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRB2INT</name>
              <description>Counter/Timer B2 interrupt.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRA2INT</name>
              <description>Counter/Timer A2 interrupt.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRB1INT</name>
              <description>Counter/Timer B1 interrupt.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRA1INT</name>
              <description>Counter/Timer A1 interrupt.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRB0INT</name>
              <description>Counter/Timer B0 interrupt.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

