cmsis-svd/cmsis-svd/data/AmbiqMicro/apollo1.svd
            </field>
            <field>
              <name>CTMRA0INT</name>
              <description>Counter/Timer A0 interrupt.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>INTSET</name>
          <description>Counter/Timer Interrupts: Set</description>
          <addressOffset>0x0000020C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>CTMRB3INT</name>
              <description>Counter/Timer B3 interrupt.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRA3INT</name>
              <description>Counter/Timer A3 interrupt.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRB2INT</name>
              <description>Counter/Timer B2 interrupt.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRA2INT</name>
              <description>Counter/Timer A2 interrupt.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRB1INT</name>
              <description>Counter/Timer B1 interrupt.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRA1INT</name>
              <description>Counter/Timer A1 interrupt.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRB0INT</name>
              <description>Counter/Timer B0 interrupt.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRA0INT</name>
              <description>Counter/Timer A0 interrupt.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
      </registers>
    </peripheral>

    <peripheral>
      <name>GPIO</name>
      <version>1.0</version>
      <description>General Purpose IO</description>
      <!-- <groupName>GROUP_GPIO</groupName> -->
      <baseAddress>0x40010000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x00000220</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>GPIO</name>
        <value>9</value>
      </interrupt>
      <registers>
        <register>
          <name>PADREGA</name>
          <description>Pad Configuration Register A</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x18181818</resetValue>
          <resetMask>0xBF3F3F3F</resetMask>

          <fields>
            <field>
              <name>PAD3PWRUP</name>
              <description>Pad 3 upper power switch enable</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Power switch disabled value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Power switch enabled value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD3FNCSEL</name>
              <description>Pad 3 function select</description>
              <bitRange>[29:27]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIG0</name>
                  <description>Configure as the ADC Trigger 0 signal value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLnCE</name>
                  <description>Configure as the IOSLAVE SPI nCE signal value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M1nCE4</name>
                  <description>Configure as the SPI channel 4 nCE signal from IOMSTR1 value.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO3</name>
                  <description>Configure as GPIO3 value.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M0nCE</name>
                  <description>Configure as the IOSLAVE SPI nCE loopback signal from IOMSTR0 value.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M1nCE</name>
                  <description>Configure as the IOSLAVE SPI nCE loopback signal from IOMSTR1 value.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pad disabled value.</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD3STRNG</name>
              <description>Pad 3 drive strength.</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low drive strength value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High drive strength value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD3INPEN</name>
              <description>Pad 3 input enable.</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pad input disabled value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pad input enabled value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD3PULL</name>
              <description>Pad 3 pullup enable</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pullup disabled value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pullup enabled value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD2FNCSEL</name>
              <description>Pad 2 function select</description>
              <bitRange>[21:19]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SLWIR3</name>
                  <description>Configure as the IOSLAVE SPI 3-wire MOSI/MISO signal value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLMOSI</name>
                  <description>Configure as the IOSLAVE SPI MOSI signal value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKOUT</name>
                  <description>Configure as the CLKOUT signal value.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO2</name>
                  <description>Configure as GPIO2 value.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M0MOSI</name>
                  <description>Configure as the IOSLAVE SPI MOSI loopback signal from IOMSTR0 value.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M1MOSI</name>
                  <description>Configure as the IOSLAVE SPI MOSI loopback signal from IOMSTR1 value.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M0WIR3</name>
                  <description>Configure as the IOSLAVE SPI 3-wire MOSI/MISO loopback signal from IOMSTR0 value.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M1WIR3</name>
                  <description>Configure as the IOSLAVE SPI 3-wire MOSI/MISO loopback signal from IOMSTR1 value.</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD2STRNG</name>
              <description>Pad 2 drive strength</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low drive strength value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High drive strength value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD2INPEN</name>
              <description>Pad 2 input enable</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pad input disabled value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pad input enabled value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD2PULL</name>
              <description>Pad 2 pullup enable</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pullup disabled value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pullup enabled value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD1FNCSEL</name>
              <description>Pad 1 function select</description>
              <bitRange>[13:11]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SLSDA</name>
                  <description>Configure as the IOSLAVE I2C SDA signal value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLMISO</name>
                  <description>Configure as the IOSLAVE SPI MISO signal value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UARTRX</name>
                  <description>Configure as the UART RX signal value.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO1</name>
                  <description>Configure as GPIO1 value.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M0MISO</name>
                  <description>Configure as the IOSLAVE SPI MISO loopback signal from IOMSTR0 value.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M1MISO</name>
                  <description>Configure as the IOSLAVE SPI MISO loopback signal from IOMSTR1 value.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M0SDA</name>
                  <description>Configure as the IOSLAVE I2C SDA loopback signal from IOMSTR0 value.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M1SDA</name>
                  <description>Configure as the IOSLAVE I2C SDA loopback signal from IOMSTR1 value.</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD1STRNG</name>
              <description>Pad 1 drive strength</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low drive strength value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High drive strength value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD1INPEN</name>
              <description>Pad 1 input enable</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pad input disabled value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pad input enabled value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD1PULL</name>
              <description>Pad 1 pullup enable</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pullup disabled value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pullup enabled value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD0FNCSEL</name>
              <description>Pad 0 function select</description>
              <bitRange>[5:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SLSCL</name>
                  <description>Configure as the IOSLAVE I2C SCL signal value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLSCK</name>
                  <description>Configure as the IOSLAVE SPI SCK signal value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UARTTX</name>
                  <description>Configure as the UART TX signal value.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO0</name>
                  <description>Configure as GPIO0 value.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M0SCK</name>
                  <description>Configure as the IOSLAVE SPI SCK loopback signal from IOMSTR0 value.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M1SCK</name>
                  <description>Configure as the IOSLAVE SPI SCK loopback signal from IOMSTR1 value.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M0SCL</name>
                  <description>Configure as the IOSLAVE I2C SCL loopback signal from IOMSTR0 value.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M1SCL</name>
                  <description>Configure as the IOSLAVE I2C SCL loopback signal from IOMSTR1 value.</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD0STRNG</name>
              <description>Pad 0 drive strength</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low drive strength value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High drive strength value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD0INPEN</name>
              <description>Pad 0 input enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pad input disabled value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pad input enabled value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD0PULL</name>
              <description>Pad 0 pullup enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pullup disabled value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pullup enabled value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PADREGB</name>
          <description>Pad Configuration Register B</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x18181818</resetValue>
          <resetMask>0x3FFFFFBF</resetMask>

