cmsis-svd/cmsis-svd/data/AmbiqMicro/apollo1.svd
          <fields>
            <field>
              <name>PAD7FNCSEL</name>
              <description>Pad 7 function select</description>
              <bitRange>[29:27]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M0WIR3</name>
                  <description>Configure as the IOMSTR0 SPI 3-wire MOSI/MISO signal value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M0MOSI</name>
                  <description>Configure as the IOMSTR0 SPI MOSI signal value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKOUT</name>
                  <description>Configure as the CLKOUT signal value.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO7</name>
                  <description>Configure as GPIO7 value.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLWIR3</name>
                  <description>Configure as the IOMSTR0 SPI 3-wire MOSI/MISO loopback signal from IOSLAVE value.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pad disabled value.</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD7STRNG</name>
              <description>Pad 7 drive strentgh</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low drive strength value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High drive strength value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD7INPEN</name>
              <description>Pad 7 input enable</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pad input disabled value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pad input enabled value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD7PULL</name>
              <description>Pad 7 pullup enable</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pullup disabled value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pullup enabled value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD6RSEL</name>
              <description>Pad 6 pullup resistor selection.</description>
              <bitRange>[23:22]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PULL1_5K</name>
                  <description>Pullup is ~1.5 KOhms value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULL6K</name>
                  <description>Pullup is ~6 KOhms value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULL12K</name>
                  <description>Pullup is ~12 KOhms value.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULL24K</name>
                  <description>Pullup is ~24 KOhms value.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD6FNCSEL</name>
              <description>Pad 6 function select</description>
              <bitRange>[21:19]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M0SDA</name>
                  <description>Configure as the IOMSTR0 I2C SDA signal value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M0MISO</name>
                  <description>Configure as the IOMSTR0 SPI MISO signal value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UACTS</name>
                  <description>Configure as the UART CTS signal value.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO6</name>
                  <description>Configure as GPIO6 value.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLMISO</name>
                  <description>Configure as the IOMSTR0 SPI MISO loopback signal from IOSLAVE value.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLSDA</name>
                  <description>Configure as the IOMSTR0 I2C SDA loopback signal from IOSLAVE value.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pad disabled value.</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD6STRNG</name>
              <description>Pad 6 drive strength</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low drive strength value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High drive strength value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD6INPEN</name>
              <description>Pad 6 input enable</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pad input disabled value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pad input enabled value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD6PULL</name>
              <description>Pad 6 pullup enable</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pullup disabled value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pullup enabled value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD5RSEL</name>
              <description>Pad 5 pullup resistor selection.</description>
              <bitRange>[15:14]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PULL1_5K</name>
                  <description>Pullup is ~1.5 KOhms value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULL6K</name>
                  <description>Pullup is ~6 KOhms value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULL12K</name>
                  <description>Pullup is ~12 KOhms value.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULL24K</name>
                  <description>Pullup is ~24 KOhms value.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD5FNCSEL</name>
              <description>Pad 5 function select</description>
              <bitRange>[13:11]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M0SCL</name>
                  <description>Configure as the IOMSTR0 I2C SCL signal value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M0SCK</name>
                  <description>Configure as the IOMSTR0 SPI SCK signal value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UARTS</name>
                  <description>Configure as the UART RTS signal value.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO5</name>
                  <description>Configure as GPIO5 value.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLSCK</name>
                  <description>Configure as the IOMSTR0 SPI SCK loopback signal from IOSLAVE value.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLSCL</name>
                  <description>Configure as the IOMSTR0 I2C SCL loopback signal from IOSLAVE value.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pad disabled value.</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD5STRNG</name>
              <description>Pad 5 drive strength</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low drive strength value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High drive strength value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD5INPEN</name>
              <description>Pad 5 input enable</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pad input disabled value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pad input enabled value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD5PULL</name>
              <description>Pad 5 pullup enable</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pullup disabled value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pullup enabled value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD4PWRUP</name>
              <description>Pad 4 upper power switch enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Power switch disabled value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Power switch enabled value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD4FNCSEL</name>
              <description>Pad 4 function select</description>
              <bitRange>[5:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIG1</name>
                  <description>Configure as the ADC Trigger 1 signal value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLINT</name>
                  <description>Configure as the IOSLAVE interrupt out signal value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M0nCE5</name>
                  <description>Configure as the SPI channel 5 nCE signal from IOMSTR0 value.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO4</name>
                  <description>Configure as GPIO4 value.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLINTGP</name>
                  <description>Configure as the IOSLAVE interrupt loopback signal to GPIO4 value.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWO</name>
                  <description>Configure as the serial wire debug SWO signal value.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKOUT</name>
                  <description>Configure as the CLKOUT signal value.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pad disabled value.</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD4STRNG</name>
              <description>Pad 4 drive strength</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low drive strength value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High drive strength value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD4INPEN</name>
              <description>Pad 4 input enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pad input disabled value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pad input enabled value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD4PULL</name>
              <description>Pad 4 pullup enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pullup disabled value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pullup enabled value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PADREGC</name>
          <description>Pad Configuration Register C</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x18181818</resetValue>
          <resetMask>0x5F3FFFFF</resetMask>

