cmsis-svd/cmsis-svd/data/AmbiqMicro/apollo1.svd
            </field>
            <field>
              <name>DIVEN</name>
              <description>Enable clock division by TOTPER.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable TOTPER division. value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable TOTPER division. value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIV3</name>
              <description>Enable divide by 3.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Select divide by 1. value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Select divide by 3. value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FSEL</name>
              <description>Select the input clock frequency.</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HFRC_DIV64</name>
                  <description>Selects the HFRC / 64 as the input clock. value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC</name>
                  <description>Selects the HFRC as the input clock. value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_DIV2</name>
                  <description>Selects the HFRC / 2 as the input clock. value.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_DIV4</name>
                  <description>Selects the HFRC / 4 as the input clock. value.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_DIV8</name>
                  <description>Selects the HFRC / 8 as the input clock. value.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_DIV16</name>
                  <description>Selects the HFRC / 16 as the input clock. value.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_DIV32</name>
                  <description>Selects the HFRC / 32 as the input clock. value.</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CMD</name>
          <description>Command Register</description>
          <addressOffset>0x00000110</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>CMD</name>
              <description>This register is the I/O Command.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POS_LENGTH</name>
                  <description>LSB bit position of the CMD LENGTH field. value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POS_OFFSET</name>
                  <description>LSB bit position of the CMD OFFSET field. value.</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POS_ADDRESS</name>
                  <description>LSB bit position of the I2C CMD ADDRESS field. value.</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POS_UPLNGTH</name>
                  <description>LSB bit position of the SPI CMD UPLNGTH field. value.</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POS_10BIT</name>
                  <description>LSB bit position of the I2C CMD 10-bit field. value.</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POS_LSB</name>
                  <description>LSB bit position of the CMD LSB-first field. value.</description>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POS_CONT</name>
                  <description>LSB bit position of the CMD CONTinue field. value.</description>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POS_OPER</name>
                  <description>LSB bit position of the CMD OPERation field. value.</description>
                  <value>29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSK_LENGTH</name>
                  <description>LSB bit mask of the CMD LENGTH field. value.</description>
                  <value>255</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSK_OFFSET</name>
                  <description>LSB bit mask of the CMD OFFSET field. value.</description>
                  <value>65280</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSK_ADDRESS</name>
                  <description>LSB bit mask of the I2C CMD ADDRESS field. value.</description>
                  <value>16711680</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSK_CHNL</name>
                  <description>LSB bit mask of the SPI CMD CHANNEL field. value.</description>
                  <value>458752</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSK_UPLNGTH</name>
                  <description>LSB bit mask of the SPI CMD UPLNGTH field. value.</description>
                  <value>125829120</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSK_10BIT</name>
                  <description>LSB bit mask of the I2C CMD 10-bit field. value.</description>
                  <value>67108864</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSK_LSB</name>
                  <description>LSB bit mask of the CMD LSB-first field. value.</description>
                  <value>134217728</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSK_CONT</name>
                  <description>LSB bit mask of the CMD CONTinue field. value.</description>
                  <value>268435456</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSK_OPER</name>
                  <description>LSB bit mask of the CMD OPERation field. value.</description>
                  <value>3758096384</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CMDRPT</name>
          <description>Command Repeat Register</description>
          <addressOffset>0x00000114</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000001F</resetMask>

          <fields>
            <field>
              <name>CMDRPT</name>
              <description>These bits hold the Command repeat count.</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>

