cmsis-svd/cmsis-svd/data/AmbiqMicro/apollo1.svd
            </field>
            <field>
              <name>FIFOPTR</name>
              <description>Current FIFO pointer.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>FIFOCFG</name>
          <description>FIFO Configuration</description>
          <addressOffset>0x00000104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x20000000</resetValue>
          <resetMask>0x3F003F1F</resetMask>

          <fields>
            <field>
              <name>ROBASE</name>
              <description>Defines the read-only area.  The IO Slave read-only area is situated in LRAM at (ROBASE*8) to (FIFOOBASE*8-1)</description>
              <bitRange>[29:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FIFOMAX</name>
              <description>These bits hold the maximum FIFO address in 8 byte segments.  It is also the beginning of the RAM area of the LRAM.  Note that no RAM area is configured if FIFOMAX is set to 0x1F.</description>
              <bitRange>[13:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FIFOBASE</name>
              <description>These bits hold the base address of the I/O FIFO in 8 byte segments. The IO Slave FIFO is situated in LRAM at (FIFOBASE*8) to (FIFOMAX*8-1).</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>FIFOTHR</name>
          <description>FIFO Threshold Configuration</description>
          <addressOffset>0x00000108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>FIFOTHR</name>
              <description>FIFO size interrupt threshold.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>FUPD</name>
          <description>FIFO Update Status</description>
          <addressOffset>0x0000010C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>

          <fields>
            <field>
              <name>IOREAD</name>
              <description>This bitfield indicates an IO read is active.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FIFOUPD</name>
              <description>This bit indicates that a FIFO update is underway.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>FIFOCTR</name>
          <description>Overall FIFO Counter</description>
          <addressOffset>0x00000110</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000003FF</resetMask>

          <fields>
            <field>
              <name>FIFOCTR</name>
              <description>Virtual FIFO byte count</description>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>FIFOINC</name>
          <description>Overall FIFO Counter Increment</description>
          <addressOffset>0x00000114</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000003FF</resetMask>

          <fields>
            <field>
              <name>FIFOINC</name>
              <description>Increment the Overall FIFO Counter by this value on a write</description>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CFG</name>
          <description>I/O Slave Configuration</description>
          <addressOffset>0x00000118</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x800FFF17</resetMask>

          <fields>
            <field>
              <name>IFCEN</name>
              <description>IOSLAVE interface enable.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable the IOSLAVE value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable the IOSLAVE value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I2CADDR</name>
              <description>7-bit or 10-bit I2C device address.</description>
              <bitRange>[19:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>STARTRD</name>
              <description>This bit holds the cycle to initiate an I/O RAM read.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LATE</name>
                  <description>Initiate I/O RAM read late in each transferred byte. value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EARLY</name>
                  <description>Initiate I/O RAM read early in each transferred byte. value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LSB</name>
              <description>This bit selects the transfer bit ordering.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MSB_FIRST</name>
                  <description>Data is assumed to be sent and received with MSB first. value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LSB_FIRST</name>
                  <description>Data is assumed to be sent and received with LSB first. value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPOL</name>
              <description>This bit selects SPI polarity.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SPI_MODES_0_3</name>
                  <description>Polarity 0, handles SPI modes 0 and 3. value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI_MODES_1_2</name>
                  <description>Polarity 1, handles SPI modes 1 and 2. value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IFCSEL</name>
              <description>This bit selects the I/O interface.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>I2C</name>
                  <description>Selects I2C interface for the IO Slave. value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI</name>
                  <description>Selects SPI interface for the IO Slave. value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PRENC</name>
          <description>I/O Slave Interrupt Priority Encode</description>
          <addressOffset>0x0000011C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000001F</resetMask>

          <fields>
            <field>
              <name>PRENC</name>
              <description>These bits hold the priority encode of the REGACC interrupts.</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>

