cmsis-svd/cmsis-svd/data/AmbiqMicro/apollo1.svd
            </field>
            <field>
              <name>MINORREV</name>
              <description>Minor device revision number.</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PKG</name>
              <description>Device package type.</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BGA</name>
                  <description>Ball grid array. value.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSP</name>
                  <description>Chip-scale package. value.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PINS</name>
              <description>Number of pins.</description>
              <bitRange>[5:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>41PINS</name>
                  <description>41 package pins total. value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TEMP</name>
              <description>Device temperature range.</description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMMERCIAL</name>
                  <description>Commercial temperature range. value.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>QUAL</name>
              <description>Device qualified.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PROTOTYPE</name>
                  <description>Prototype device. value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUALIFIED</name>
                  <description>Fully qualified device. value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CHIPID0</name>
          <description>Unique Chip ID 0</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>VALUE</name>
              <description>Unique chip ID 0.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>APOLLO</name>
                  <description>Apollo CHIPID0. value.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CHIPID1</name>
          <description>Unique Chip ID 1</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>VALUE</name>
              <description>Unique chip ID 1.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>APOLLO</name>
                  <description>Apollo CHIPID1. value.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CHIPREV</name>
          <description>Chip Revision</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>REVISION</name>
              <description>Chip Revision Number.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>APOLLO</name>
                  <description>Apollo CHIPREV. value.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SUPPLYSRC</name>
          <description>Memory and Core Voltage Supply Source Select Register</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>

          <fields>
            <field>
              <name>COREBUCKEN</name>
              <description>Enables and Selects the Core Buck as the supply for the low-voltage power domain.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable the Core Buck for the low-voltage power domain. value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MEMBUCKEN</name>
              <description>Enables and select the Memory Buck as the supply for the Flash and SRAM power domain.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable the Memory Buck as the supply for flash and SRAM. value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SUPPLYSTATUS</name>
          <description>Memory and Core Voltage Supply Source Status Register</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>

          <fields>
            <field>
              <name>COREBUCKON</name>
              <description>Indicates whether the Core low-voltage domain is supplied from the LDO or the Buck.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LDO</name>
                  <description>Indicates the the LDO is supplying the Core low-voltage. value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUCK</name>
                  <description>Indicates the the Buck is supplying the Core low-voltage. value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MEMBUCKON</name>
              <description>Indicate whether the Memory power domain is supplied from the LDO or the Buck.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LDO</name>
                  <description>Indicates the LDO is supplying the memory power domain. value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUCK</name>
                  <description>Indicates the Buck is supplying the memory power domain. value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BANDGAPEN</name>
          <description>Band Gap Enable</description>
          <addressOffset>0x000000FC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>BGPEN</name>
              <description>Bandgap Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Bandgap disable. value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Bandgap enable. value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SRAMPWDINSLEEP</name>
          <description>Powerdown an SRAM Bank in Deep Sleep mode</description>
          <addressOffset>0x00000140</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>BANK7</name>
              <description>Force SRAM Bank 7 to powerdown in deep sleep mode, causing the contents of the bank to be lost.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>SRAM Bank 7 normal operation. value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWRDN_IN_DEEPSLEEP</name>
                  <description>SRAM Bank 7 deep sleep. value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BANK6</name>
              <description>Force SRAM Bank 6 to powerdown in deep sleep mode, causing the contents of the bank to be lost.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>SRAM Bank 6 normal operation. value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWRDN_IN_DEEPSLEEP</name>
                  <description>SRAM Bank 6 deep sleep. value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BANK5</name>
              <description>Force SRAM Bank 5 to powerdown in deep sleep mode, causing the contents of the bank to be lost.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>SRAM Bank 5 normal operation. value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWRDN_IN_DEEPSLEEP</name>
                  <description>SRAM Bank 5 deep sleep. value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BANK4</name>
              <description>Force SRAM Bank 4 to powerdown in deep sleep mode, causing the contents of the bank to be lost.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>SRAM Bank 4 normal operation. value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWRDN_IN_DEEPSLEEP</name>
                  <description>SRAM Bank 4 deep sleep. value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BANK3</name>
              <description>Force SRAM Bank 3 to powerdown in deep sleep mode, causing the contents of the bank to be lost.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>SRAM Bank 3 normal operation. value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWRDN_IN_DEEPSLEEP</name>
                  <description>SRAM Bank 3 deep sleep. value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BANK2</name>
              <description>Force SRAM Bank 2 to powerdown in deep sleep mode, causing the contents of the bank to be lost.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>SRAM Bank 2 normal operation. value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWRDN_IN_DEEPSLEEP</name>
                  <description>SRAM Bank 2 deep sleep. value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BANK1</name>
              <description>Force SRAM Bank 1 to powerdown in deep sleep mode, causing the contents of the bank to be lost.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>SRAM Bank 1 normal operation. value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWRDN_IN_DEEPSLEEP</name>
                  <description>SRAM Bank 1 deep sleep. value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BANK0</name>
              <description>Force SRAM Bank 0 to powerdown in deep sleep mode, causing the contents of the bank to be lost.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>SRAM Bank 0 normal operation. value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWRDN_IN_DEEPSLEEP</name>
                  <description>SRAM Bank 0 deep sleep. value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SRAMPWRDIS</name>
          <description>Disables individual banks of the SRAM array</description>
          <addressOffset>0x00000144</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>BANK7</name>
              <description>Remove power from SRAM Bank 7 which will cause an access to its address space to generate a Hard Fault.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable SRAM Bank 7. value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BANK6</name>
              <description>Remove power from SRAM Bank 6 which will cause an access to its address space to generate a Hard Fault.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable SRAM Bank 6. value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BANK5</name>
              <description>Remove power from SRAM Bank 5 which will cause an access to its address space to generate a Hard Fault.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable SRAM Bank 5. value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BANK4</name>
              <description>Remove power from SRAM Bank 4 which will cause an access to its address space to generate a Hard Fault.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable SRAM Bank 4. value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BANK3</name>
              <description>Remove power from SRAM Bank 3 which will cause an access to its address space to generate a Hard Fault.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable SRAM Bank 3. value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BANK2</name>
              <description>Remove power from SRAM Bank 2 which will cause an access to its address space to generate a Hard Fault.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable SRAM Bank 2. value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BANK1</name>
              <description>Remove power from SRAM Bank 1 which will cause an access to its address space to generate a Hard Fault.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable SRAM Bank 1. value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BANK0</name>
              <description>Remove power from SRAM Bank 0 which will cause an access to its address space to generate a Hard Fault.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable SRAM Bank 0. value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASHPWRDIS</name>
          <description>Disables individual banks of the Flash array</description>
          <addressOffset>0x00000148</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>

