cmsis-svd/cmsis-svd/data/AmbiqMicro/apollo1.svd
      </registers>
    </peripheral>

    <peripheral>
      <name>RSTGEN</name>
      <version>1.0</version>
      <description>MCU Reset Generator</description>
      <!-- <groupName>GROUP_RSTGEN</groupName> -->
      <baseAddress>0x40000000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x00000210</size>
        <usage>registers</usage>
      </addressBlock>

      <registers>
        <register>
          <name>CFG</name>
          <description>Configuration Register</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>

          <fields>
            <field>
              <name>WDREN</name>
              <description>Watchdog Timer Reset Enable.  NOTE: The WDT module must also be configured for WDT reset.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BODHREN</name>
              <description>Brown out high (2.1v) reset enable.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SWPOI</name>
          <description>Software POI Reset</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>SWPOIKEY</name>
              <description>0x1B generates a software POI reset.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>KEYVALUE</name>
                  <description>Writing 0x1B key value generates a software POI reset. value.</description>
                  <value>27</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SWPOR</name>
          <description>Software POR Reset</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>SWPORKEY</name>
              <description>0xD4 generates a software POR reset.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>KEYVALUE</name>
                  <description>Writing 0xD4 key value generates a software POR reset. value.</description>
                  <value>212</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STAT</name>
          <description>Status Register</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000007F</resetMask>

          <fields>
            <field>
              <name>WDRSTAT</name>
              <description>Reset was initiated by a Watchdog Timer Reset.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DBGRSTAT</name>
              <description>Reset was a initiated by Debugger Reset.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>POIRSTAT</name>
              <description>Reset was a initiated by Software POI Reset.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SWRSTAT</name>
              <description>Reset was a initiated by SW POR or AIRCR Reset.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BORSTAT</name>
              <description>Reset was initiated by a Brown-Out Reset.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PORSTAT</name>
              <description>Reset was initiated by a Power-On Reset.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>EXRSTAT</name>
              <description>Reset was initiated by an External Reset.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CLRSTAT</name>
          <description>Clear the status register</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>CLRSTAT</name>
              <description>Writing a 1 to this bit clears all bits in the RST_STAT.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

