cmsis-svd/cmsis-svd/data/AmbiqMicro/apollo1.svd
            </field>
            <field>
              <name>FEIC</name>
              <description>This bit holds the framing error interrupt clear.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RTIC</name>
              <description>This bit holds the receive timeout interrupt clear.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TXIC</name>
              <description>This bit holds the transmit interrupt clear.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RXIC</name>
              <description>This bit holds the receive interrupt clear.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSRMIC</name>
              <description>This bit holds the modem DSR interrupt clear.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DCDMIC</name>
              <description>This bit holds the modem DCD interrupt clear.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTSMIC</name>
              <description>This bit holds the modem CTS interrupt clear.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RIMIC</name>
              <description>This bit holds the modem RI interrupt clear.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
      </registers>
    </peripheral>

    <peripheral>
      <name>VCOMP</name>
      <version>1.0</version>
      <description>Voltage Comparator</description>
      <!-- <groupName>GROUP_VCOMP</groupName> -->
      <baseAddress>0x4000C000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x00000210</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>VCOMP</name>
        <value>3</value>
      </interrupt>
      <registers>
        <register>
          <name>CFG</name>
          <description>Configuration Register</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000F0303</resetMask>

          <fields>
            <field>
              <name>LVLSEL</name>
              <description>When the reference input NSEL is set to NSEL_DAC, this bitfield selects the voltage level for the negative input to the comparator.</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0P58V</name>
                  <description>Set Reference input to 0.58 Volts. value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0P77V</name>
                  <description>Set Reference input to 0.77 Volts. value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0P97V</name>
                  <description>Set Reference input to 0.97 Volts. value.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1P16V</name>
                  <description>Set Reference input to 1.16 Volts. value.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1P35V</name>
                  <description>Set Reference input to 1.35 Volts. value.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1P55V</name>
                  <description>Set Reference input to 1.55 Volts. value.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1P74V</name>
                  <description>Set Reference input to 1.74 Volts. value.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1P93V</name>
                  <description>Set Reference input to 1.93 Volts. value.</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2P13V</name>
                  <description>Set Reference input to 2.13 Volts. value.</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2P32V</name>
                  <description>Set Reference input to 2.32 Volts. value.</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2P51V</name>
                  <description>Set Reference input to 2.51 Volts. value.</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2P71V</name>
                  <description>Set Reference input to 2.71 Volts. value.</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2P90V</name>
                  <description>Set Reference input to 2.90 Volts. value.</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3P09V</name>
                  <description>Set Reference input to 3.09 Volts. value.</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3P29V</name>
                  <description>Set Reference input to 3.29 Volts. value.</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3P48V</name>
                  <description>Set Reference input to 3.48 Volts. value.</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSEL</name>
              <description>This bitfield selects the negative input to the comparator.</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VREFEXT1</name>
                  <description>Use external reference 1 for reference input. value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VREFEXT2</name>
                  <description>Use external reference 2 for reference input. value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VREFEXT3</name>
                  <description>Use external reference 3 for reference input. value.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PSEL</name>
              <description>This bitfield selects the positive input to the comparator.</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VDDADJ</name>
                  <description>Use VDDADJ for the positive input. value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VTEMP</name>
                  <description>Use the temperature sensor output for the positive input. value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VEXT1</name>
                  <description>Use external voltage 1 for positive input. value.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VEXT2</name>
                  <description>Use external voltage 1 for positive input. value.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STAT</name>
          <description>Status Register</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>

          <fields>
            <field>
              <name>PWDSTAT</name>
              <description>This bit indicates the power down state of the voltage comparator.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POWERED_DOWN</name>
                  <description>The voltage comparator is powered down. value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMPOUT</name>
              <description>This bit is 1 if the positive input of the comparator is greater than the negative input.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VOUT_LOW</name>
                  <description>The negative input of the comparator is greater than the positive input. value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VOUT_HIGH</name>
                  <description>The positive input of the comparator is greater than the negative input. value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PWDKEY</name>
          <description>Key Register for Powering Down the Voltage Comparator</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>PWDKEY</name>
              <description>Key register value.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Key</name>
                  <description>Key value.</description>
                  <value>55</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTEN</name>
          <description>Voltage Comparator Interrupt registers: Enable</description>
          <addressOffset>0x00000200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>

          <fields>
            <field>
              <name>OUTHI</name>
              <description>This bit is the vcompout high interrupt.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

